app/controllers/movies_controller.rb

  def index
    @title
    @release_date
    unless params[:ratings] or params[:sort]
      redirect_to movies_path(@index, ratings: session[:picked_ratings], sort: session[:sort])
    end
    if params[:sort]
      sort = params[:sort]
      session[:sort] = sort
    else
      if session[:sort]
        sort = session[:sort]
        params[:sort] = sort
      else
        sort = 'id'
      end
    end
    session[:picked_ratings] = params[:ratings] if params[:ratings]
    if params[:ratings]
      @picked_ratings = params[:ratings].keys
    else
      if session[:picked_ratings]
        @picked_ratings = session[:picked_ratings].keys
        params[:ratings] = session[:picked_ratings]
      else
        @picked_ratings = ratings
      end
    end
    @movies = Movie.where(rating: @picked_ratings).order(sort)
---
SELECT "movies".* FROM "movies" WHERE "rating"."G" = '1' AND "rating"."R" = '1' AND "rating"."PG-13" = '1' ORDER BY id